CREATE DATABASE  IF NOT EXISTS `blog` /*!40100 DEFAULT CHARACTER SET utf8 */;
USE `blog`;
-- MySQL dump 10.13  Distrib 5.7.12, for Win32 (AMD64)
--
-- Host: localhost    Database: blog
-- ------------------------------------------------------
-- Server version	5.6.37

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `article`
--

DROP TABLE IF EXISTS `article`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `article` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `title` varchar(45) NOT NULL,
  `cate_name` varchar(10) DEFAULT NULL,
  `author` varchar(20) DEFAULT NULL,
  `content` text,
  `time` timestamp NULL DEFAULT CURRENT_TIMESTAMP,
  `views` int(11) DEFAULT '0',
  PRIMARY KEY (`id`,`title`)
) ENGINE=InnoDB AUTO_INCREMENT=10 DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `article`
--

LOCK TABLES `article` WRITE;
/*!40000 ALTER TABLE `article` DISABLE KEYS */;
INSERT INTO `article` VALUES (1,'鸟巢门票价格暴跌！黄牛跳楼','PHP','我写的','鸟巢门票价格暴跌！黄牛跳楼\r\n20元一张收购鸟巢门票，全网最高价格','2017-10-30 08:56:11',4),(2,'西游记','java','吴承恩','西游记，四大名著之一','2017-10-31 08:08:57',2),(3,'水浒传','PHP','施耐庵','话说大宋仁宗天子在位，嘉祐三年三月三日五更三点，天子驾坐紫宸殿，受百\r\n官朝贺。但见：\r\n　　祥云迷凤阁，瑞气罩龙楼。含烟御柳拂旌旗，带露宫花迎剑戟。天香影里，玉\r\n簪朱履聚丹墀；仙乐声中，绣袄锦衣扶御驾。珍珠帘卷，黄金殿上现金轝，凤羽扇\r\n开，白玉阶前停宝辇。隐隐净鞭三下响，层层文武两班齐。\r\n    当有殿头官喝道：“有事出班早奏，无事卷帘退朝。”只见班部丛中，宰相赵\r\n哲、参政文彦博出班奏曰：“目今京师瘟疫盛行，伤损军民甚多。伏望陛下释罪宽\r\n恩，省刑薄税，祈禳天灾，救济万民。”天子听奏，急敕翰林院随即草诏，一面降\r\n赦天下罪囚，应有民间税赋，悉皆赦免；一面命在京宫观寺院，修设好事禳灾。不\r\n料其年瘟疫转盛，仁宗天子闻知，龙体不安，复会百官计议。向那班部中，有一大\r\n臣，越班启奏。天子看时，乃是参知政事范仲淹，拜罢起居，奏曰：“目今天灾盛\r\n行，军民涂炭，日夕不能聊生。以臣愚意，要禳此灾，可宣嗣汉天师星夜临朝，就\r\n京师禁院，修设三千六百分罗天大醮，奏闻上帝，可以禳保民间瘟疫。”仁宗天子\r\n准奏，急令翰林学士草诏一道，天子御笔亲书，并降御香一炷，钦差内外提点殿前\r\n太尉洪信为天使，前往江西信州龙虎山，宣请嗣汉天师张真人星夜来朝，祈禳瘟疫。\r\n就金殿上焚起御香，亲将丹诏付与洪太尉，即便登程前去。\r\n　　洪信领了圣敕，辞别天子，背了诏书，盛了御香，带了数十人，上了铺马，一\r\n行部队，离了东京，取路径投信州贵溪县来。但见：\r\n　　遥山叠翠，远水澄清。奇花绽锦绣铺林，嫩柳舞金丝拂地。风和日暖，时过野\r\n店山村；路直沙平，夜宿邮亭驿馆。罗衣荡漾红尘内，骏马驰驱紫陌中。\r\n　　且说太尉洪信赍擎御诏，一行人从，上了路途，不止一日，来到江西信州。大\r\n小官员，出郭迎接。随即差人报知龙虎山上清宫住持道众，准备接诏。次日，众位\r\n官同送太尉到于龙虎山下，只见上清宫许多道众，鸣钟击鼓，香花灯烛，幢幡宝盖，\r\n一派仙乐，都下山来迎接丹诏，直至上清宫前下马。太尉看那宫殿时，端的是好座\r\n上清宫!但见：\r\n　　青松屈曲，翠柏阴森。门悬敕额金书，户列灵符玉篆。虚皇坛畔，依稀垂柳名\r\n花；炼药炉边，掩映苍松老桧。左壁厢天丁力士，参随着太乙真君；右势下玉女金\r\n童，簇捧定紫微大帝。披发仗剑，北方真武踏龟蛇；趿履顶冠，南极老人伏龙虎。\r\n前排二十八宿星君，后列三十二帝天子。阶砌下流水潺。墙院后好山环绕。鹤生\r\n丹顶，龟长绿毛。树梢头献果苍猿，莎草内衔芝白鹿。三清殿上，击金钟道士步虚；\r\n四圣堂前，敲玉罄真人礼斗。献香台砌，彩霞光射碧琉璃；召将瑶坛，赤日影摇红\r\n玛瑙。早来门外祥云现，疑是天师送老君。\r\n　　当下上自住持真人，下及道童侍从，前迎后引，接至三清殿上，请将诏书居中\r\n供养着。洪太尉便问监宫真人道：“天师今在何处？”住持真人向前禀道：“好教\r\n太尉得知：这代祖师，号曰虚靖天师，性好清高，倦于迎送，自向龙虎山顶，结一\r\n茅庵，修真养性。因此不住本宫。”太尉道：“目今天子宣诏，如何得见？”真人\r\n答道：“容禀：诏敕权供在殿上，贫道等亦不敢开读。且请太尉到方丈献茶，再烦\r\n计议。”当时将丹诏供养在三清殿上，与众官都到方丈。太尉居中坐下，执事人等\r\n献茶，就进斋供，水陆俱备。斋罢，太尉再问真人道：“既然天师在山顶庵中，何\r\n不着人请将下来相见，开宣丹诏。”真人禀道：“这代祖师，虽在山顶，其实道行\r\n非常，能驾雾兴云，踪迹不定。贫道等如常亦难得见，怎生教人请得下来？”太尉\r\n道：“似此如何得见?目今京师瘟疫盛行，今上天子特遣下官赍捧御书丹诏，亲奉\r\n龙香，来请天师，要做三千六百分罗天大醮，以禳天灾，救济万民。似此怎生奈何？”\r\n真人禀道：“天子要救万民，只除是太尉办一点志诚心，斋戒沐浴，更换布衣，休\r\n带从人，自背诏书，焚烧御香，步行上山礼拜，叩请天师，方许得见。如若心不志\r\n诚，空走一遭，亦难得见。”太尉听说，便道：“俺从京师食素到此，如何心不志\r\n诚。既然恁地，依着你说，明日绝早上山。”\r\n　　当晚各自权歇。次日五更时分，众道士起来，备下香汤，请太尉起来沐浴，换\r\n了一身新鲜布衣，脚下穿上麻鞋草履，吃了素斋，取过丹诏，用黄罗包袱背在脊梁\r\n上，手里提着银手炉，降降地烧着御香，许多道众人等，送到后山，指与路径。真\r\n人又禀道：“太尉要救万民，休生退悔之心，只顾志诚上去。”\r\n　　太尉别了众人，口诵天尊宝号，纵步上山来。将至半山，望见大顶直侵霄汉，\r\n果然好座大山!正是：\r\n　　根盘地角，顶接天心。远观磨断乱云痕，近看平吞明月魄。高低不等谓之山，\r\n侧石通道谓之岫，孤岭崎岖谓之路，上面平极谓之顶。头圆下壮谓之峦，藏虎藏豹\r\n谓之穴，隐风隐云谓之岩，高人隐居谓之洞。有境有界谓之府，樵人出没谓之径，\r\n能通车马谓之道，流水有声谓之涧，古渡源头谓之溪，岩崖滴水谓之泉。左壁为掩，\r\n右壁为映。出的是云，纳的是雾。锥尖像小，崎峻似峭，悬空似险，削如平。千\r\n峰竞秀，万壑争流，瀑布斜飞，藤萝倒挂。虎啸时风生谷口，猿啼时月坠山腰。恰\r\n似青黛染成千块玉，碧纱笼罩万堆烟。\r\n　　这洪太尉独自一个行了一回，盘坡转径，揽葛攀藤。约莫走过了数个山头，三\r\n二里多路，看看脚酸腿软，正走不动，口里不说，肚里踌躇，心中想道：“我是朝\r\n廷贵官，在京师时，重裀而卧，列鼎而食，尚兀自倦怠，何曾穿草鞋，走这般山路!\r\n知他天师在那里，却教下官受这般苦！”又行不到三五十步，掇着肩气喘，只见山\r\n凹里起一阵风。风过处，向那松树背后，奔雷也似吼了一声，扑地跳出一个吊睛白\r\n额锦毛大虫来，洪太尉吃了一惊，叫声：“阿呀！”扑地望后便倒。偷眼看那大虫\r\n时，但见：\r\n毛披一带黄金色，爪露银钩十八只。\r\n睛如闪电尾如鞭，口似血盆牙似戟。\r\n伸腰展臂势狰狞，摆尾摇头声霹雳。\r\n山中狐兔尽潜藏，涧下獐皆敛迹。\r\n　　那大虫望着洪太尉，左盘右旋，咆哮了一回，托地望后山坡下跳了去。洪太尉\r\n倒在树根底下，唬的三十六个牙齿捉对儿厮打，那心头一似十五个吊桶，七上八落\r\n的响，浑身却如重风麻木，两腿一似斗败公鸡，口里连声叫苦。\r\n　　大虫去了一盏茶时，方才爬将起来，再收拾地上香炉，还把龙香烧着，再上山\r\n来，务要寻见天师。又行过三五十步，口里叹了数口气，怨道：“皇帝御限差俺来\r\n这里，教我受这场惊恐。”说犹未了，只觉得那里又一阵风，吹得毒气直冲将来，\r\n太尉定睛看时，山边竹藤里簌簌地响，抢出一条吊桶大小雪花也似蛇来。太尉见了，\r\n又吃一惊，撇了手炉，叫一声：“我今番死也！”往后便倒在盘陀石边。微闪开眼\r\n来看那蛇时，但见：\r\n　　昂首惊飙起，掣目电光生。动荡则折峡倒冈，呼吸则吹云吐雾。鳞甲乱分千片\r\n玉，尾梢斜卷一堆银。\r\n    那条大蛇，径抢到盘陀石边，朝着洪太尉盘做一堆，两只眼迸出金光，张开巨\r\n口，吐出舌头，喷那毒气在洪太尉脸上，惊得太尉三魂荡荡，七魄悠悠。那蛇看了\r\n洪太尉一回，望山下一溜，却早不见了。太尉方才爬得起来，说道：“惭愧!惊杀下\r\n官！”看身上时，寒栗子比餶飿儿大小，口里骂那道士：“叵耐无礼，戏弄下官，\r\n教俺受这般惊恐!若山上寻不见天师，下去和他别有话说。”再拿了银提炉，整顿身\r\n上诏敕，并衣服巾帻，却待再要上山去。正欲移步，只听得松树背后隐隐地笛声吹\r\n响，渐渐近来。太尉定睛看时，只见那一个道童，倒骑着一头黄牛，横吹着一管铁\r\n笛，转出山凹来。太尉看那道童时：\r\n　　头绾两枚丫髻，身穿一领青衣，腰间绦结草来编，脚下芒鞋麻间隔。明眸皓齿，\r\n飘飘并不染尘埃；绿鬓朱颜，耿耿全然无俗态。\r\n昔日吕洞宾有首牧童诗道得好：\r\n草铺横野六七里，笛弄晚风三四声。\r\n归来饱饭黄昏后，不脱蓑衣卧月明。\r\n　　但见那个道童笑吟吟地骑着黄牛，横吹着那管铁笛，正过山来。洪太尉见了，\r\n便唤那个道童：“你从那里来?认得我么？”道童不睬，只顾吹笛。太尉连问数声，\r\n道童呵呵大笑，拿着铁笛，指着洪太尉说道：“你来此间，莫非要见天师么？”太\r\n尉大惊，便道：“你是牧童，如何得知？”道童笑道：“我早间在草庵中伏侍天师，\r\n听得天师说道：‘今上皇帝差个洪太尉赍擎丹诏御香，到来山中，宣我往东京做三\r\n千六百分罗天大醮，祈禳天下瘟疫，我如今乘鹤驾云去也。’这早晚想是去了，不\r\n在庵中。你休上去，山内毒虫猛兽极多，恐伤害了你性命。”太尉再问道：“你不\r\n要说谎。”道童笑了一声，也不回应，又吹着铁笛，转过山坡去了。太尉寻思道：\r\n“这小的如何尽知此事?想是天师分付他，已定是了。”欲待再上山去；方才惊\r\n的苦，争些儿送了性命，不如下山去罢。\r\n　　太尉拿着提炉，再寻旧路，奔下山来。众道士接着，请至方丈坐下。真人便问\r\n太尉道：“曾见天师么？”太尉说道：“我是朝中贵官，如何教俺走得山路，吃了\r\n这般辛苦，争些儿送了性命。为头上至半山里，跳出一只吊睛白额大虫，惊得下官\r\n魂魄都没了；又行不过一个山嘴，竹藤里抢出一条雪花大蛇来，盘做一堆，拦住去\r\n路。若不是俺福分大，如何得性命回京?尽是你这道众戏弄下官。”真人复道：“贫\r\n道等怎敢轻慢大臣?这是祖师试探太尉之心。本山虽有蛇虎，并不伤人。”太尉又\r\n道：“我正走不动，方欲再上山坡，只见松树旁边转出一个道童，骑着一头黄牛，\r\n吹着管铁笛，正过山来，我便问他：‘那里来?识得俺么？’他道：‘已都知了。’\r\n说天师分付，早晨乘鹤驾云，往东京去了，下官因此回来。”真人道：“太尉可惜\r\n错过，这个牧童，正是天师。”太尉道：“他既是天师，如何这等猥獕？”真人答\r\n道：“这代天师，非同小可。虽然年幼，其实道行非常。他是额外之人，四方显化，\r\n极是灵验，世人皆称为道通祖师。”洪太尉道：“我直如此有眼不识真师，当面错\r\n过！”真人道：“太尉且请放心。既然祖师法旨道是去了，比及太尉回京之日，这\r\n场醮事，祖师已都完了。”太尉见说，方才放心。真人一面教安排筵宴，管待太尉，\r\n请将丹诏收藏于御书匣内，留在上清宫中，龙香就三清殿上烧了。当日方丈内大排\r\n斋供，设宴饮酌，至晚席罢，止宿到晓。\r\n　　次日早膳以后，真人、道众并提点、执事人等，请太尉游山。太尉大喜。许多\r\n人从跟随着，步行出方丈，前面两个道童引路。行至宫前宫后，看玩许多景致。三\r\n清殿上，富贵不可尽言。左廊下九天殿、紫微殿、北极殿；右廊下太乙殿、三官殿、\r\n驱邪殿。诸宫看遍，行到右廊后一所去处。洪太尉看时，另外一所殿宇：一遭都是\r\n捣椒红泥墙；正面两扇朱红格子，门上使着膊大锁锁着，交叉上面贴着十数道封\r\n皮，封皮上又是重重叠叠使着朱印；檐前一面朱红漆金字牌额，左书四个金字，写\r\n道：“伏魔之殿”。太尉指着门道：“此殿是甚么去处？”真人答道：“此乃是前\r\n代老祖天师锁镇魔王之殿。”太尉又问道：“如何上面重重叠叠贴着许多封皮？”\r\n真人答道：“此是老祖大唐洞玄国师封锁魔王在此。但是经传一代天师，亲手便添\r\n一道封皮，使其子子孙孙，不得妄开。走了魔君，非常利害。今经八九代祖师，誓\r\n不敢开。锁用铜汁灌铸，谁知里面的事?小道自来住持本宫三十余年，也只听闻。”\r\n　　洪太尉听了，心中惊怪，想道：“我且试看魔王一看。”便对真人说道：“你\r\n且开门来，我看魔王甚么模样。”真人告道：“太尉，此殿决不敢开!先祖天师叮\r\n咛告戒：今后诸人不许擅开。”太尉笑道：“胡说!你等要妄生怪事，煽惑良民，\r\n故意安排这等去处，假称锁镇魔王，显耀你们道术。我读一鉴之书，何曾见锁魔之\r\n法!神鬼之道，处隔幽冥，我不信有魔王在内。快与我打开，我看魔王如何！”真\r\n人三回五次禀说：“此殿开不得，恐惹利害，有伤于人。”太尉大怒，指着道众说\r\n道：“你等不开与我看，回到朝廷，先奏你们众道士阻当宣诏，违别圣旨，不令我\r\n见天师的罪犯；后奏你等私设此殿，假称锁镇魔王，煽惑军民百姓。把你都追了度\r\n牒，刺配远恶军州受苦。”\r\n　　真人等惧怕太尉权势，只得唤几个火工道人来，先把封皮揭了，将铁锤打开大\r\n锁，众人把门推开，看里面时，黑洞洞地，但见：\r\n　　昏昏默默，杳杳冥冥，数百年不见太阳光，亿万载难瞻明月影。不分南北，怎\r\n辨东西。黑烟霭霭扑人寒，冷气阴阴侵体颤。人迹不到之处，妖精往来之乡，闪开\r\n双目有如盲，伸出两手不见掌。常如三十夜，却似五更时。\r\n　　众人一齐都到殿内，黑暗暗不见一物。太尉教从人取十数个火把点着，将来打\r\n一照时，四边并无一物，只中央一个石碑，约高五六尺，下面石龟趺坐，大半陷在\r\n泥里。照那碑碣上时，前面都是龙章凤篆，天书符籙，人皆不识。照那碑后时，却\r\n有四个真字大书，凿着“遇洪而开”。却不是一来天罡星合当出世，二来宋朝必显\r\n忠良，三来凑巧遇着洪信，岂不是天数?洪太尉看了这四个字，大喜，便对真人说\r\n道：“你等阻当我，却怎地数百年前已注定我姓字在此?遇洪而开，分明是教我开\r\n看，却何妨。我想这个魔王，都只在石碑底下。汝等从人，与我多唤几个火工人等，\r\n将锄头铁锹来掘开。”\r\n　　真人慌忙谏道：“太尉不可掘动，恐有利害，伤犯于人，不当稳便。”太尉大\r\n怒，喝道：“你等道众，省得甚么?碑上分明凿着遇我教开，你如何阻当?快与我唤\r\n人来开。”真人又三回五次禀道：“恐有不好。”太尉那里肯听，只得聚集众人，\r\n先把石碑放倒，一齐并力掘那石龟，半日方才掘得起。又掘下去，约有三四尺深，\r\n见一片大青石板，可方丈围。洪太尉叫再掘起来，真人又苦禀道：“不可掘动。”\r\n太尉那里肯听，众人只得把石板一齐扛起，看时，石板底下，却是一个万丈深浅地\r\n穴。只见穴内刮喇喇一声响亮。那响非同小可，恰似：\r\n　　天摧地塌，岳撼山崩。钱塘江上，潮头浪拥出海门来；泰华山头，巨灵神一劈\r\n山峰碎。共工奋怒，去盔撞倒了不周山；力士施威，飞锤击碎了始皇辇。一风撼折\r\n千竿竹，十万军中半夜雷。\r\n那一声响亮过处，只见一道黑气，从穴里滚将起来，掀塌了半个殿角。那道黑气，\r\n直冲到半天里空中，散作百十道金光，望四面八方去了。众人吃了一惊，发声喊，\r\n都走了，撇下锄头铁锹，尽从殿内奔将出来，推倒翻无数。惊得洪太尉目睁口呆，\r\n罔知所措，面色如土，奔到廊下，只见真人向前叫苦不迭。\r\n　　太尉问道：“走了的却是甚么妖魔？”那真人言不过数句，话不过一席，说出\r\n这个缘由。有分教：一朝皇帝，夜眠不稳，昼食忘餐。直使：宛子城中藏虎豹，蓼\r\n儿洼内聚神蛟。\r\n　　毕竟龙虎山真人说出甚么言语来，且听下回分解。','2017-10-31 14:11:55',114),(4,'XXX从入门到精通','java','我写的','height:1300px;','2017-10-31 14:54:30',10),(5,'红楼梦','PHP','曹雪芹','四大名著之一','2017-10-31 14:59:27',24),(6,'三国演义','PHP','罗贯中','四大名著之一','2017-10-31 15:01:09',18),(7,'魔法禁书目录','C语言','廉池和马','绝对能力者\r\n超能力者','2017-10-31 15:13:41',92),(8,'说什么好呢','java','abc','不知道就是不知道','2017-11-06 12:02:19',42),(9,'哇咔咔','PHP','小胖子','就不说什么了','2017-11-07 15:06:47',0);
/*!40000 ALTER TABLE `article` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2017-11-25 12:54:55
